Autodesk.Navisworks.Api.Data.DatabaseChangedAction
Determines which action should do after transaction

Autodesk.Navisworks.Api.Data.DatabaseChangedAction.Edited
Undoable update database, insert|update|delete row

Autodesk.Navisworks.Api.Data.DatabaseChangedAction.Reset
Non undoable database operate, like create table